Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/flight_computer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# No power management — runs at full speed
CONFIG_PM_ENABLE=n

# No BLE on FlightComputer
CONFIG_BT_ENABLED=n

# Flash
# Boot NOR is a 128 Mbit (16 MB) part on every placement in the fleet
# (rocket-computer U13/U16): GD25Q128ESIG today, W25Q128JVSIQ on boards fabbed before
# 2026-08-15 — both 16 MB. Declaring 8 MB left half the part
# unreachable and made every boot log "Detected size(16384k) larger
# than the size in the binary image header(8192k)".
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: a relayed image boots PENDING_VERIFY and auto-reverts to ota_0
# unless the FC marks itself valid after resuming its I2S telemetry stream to
# the OC post-reboot. See docs/plans/08-ota-firmware-update.md §4 / §7.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- ESP32-P4 / IDF version tuning (#88) ---------------------------------
# ESP32-P4 silicon: our boards are v1.x. IDF 5.5+ raises the default min chip
# rev to v3.x, which refuses to boot on v1.x. Accept the legacy series.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Brownout: IDF 5.5 defaults the P4 detector to 2.6V (LVL_SEL_7), which trips
# during servo-PWM init on this board. Pin to the most-lenient level (2.42V).
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5=y

# Main task stack: the 5.5 default (3584 B) overflows FC's synchronous sensor
# init when the Arduino loop stack isn't present. Restore the prior 16 KB.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# --- Deliberately-unused silicon on the FC (#851) -------------------------
# Recorded as DECISIONS, not omissions.  The OC spent a month discovering its
# PSRAM only after the MRAM was deleted from under it; the point of writing
# these down is that the next person reads "off because we decided" rather
# than "off because nobody looked".
#
# 1) U17 is an ESP32-P4NRW32 — 32 MB of IN-PACKAGE PSRAM — and there is no
#    CONFIG_SPIRAM here on purpose.  The FC has no identified need: its logs
#    stream to the OC over I2S rather than buffering locally, which is what
#    the OC's PSRAM exists for (#842, the MRAM's replacement).  Enabling it
#    is NOT free on this board — PSRAM access goes through the cache and can
#    perturb the timing determinism of a 3840 Hz IMU path and a ~976 Hz
#    control loop, which is measured and currently clean.  Revisit only when
#    something concrete needs the space, and re-measure loop timing and the
#    gap counters (#910) if it is ever turned on.
#
# 2) Y3, the FC's 32.768 kHz crystal, is fitted but unused: no
#    CONFIG_RTC_CLK_SRC_EXT_CRYS, so the RTC runs on the internal RC.  That
#    is fine here — the crystal matters for light-sleep and accurate RTC
#    timekeeping, and the FC does neither.  It is awake for the whole flight,
#    and the low-power path belongs to the OC (#519: EXT_CRYS + BT LP clock
#    + XT-WDT).  If FC light-sleep is ever wanted, this is the first switch.
#
# 3) Boot NOR: V9 fits W25Q128JVSIQ (16 MB) and this file now declares 16 MB.
#    NOTE the partition table (partitions.csv) still tops out near 6.4 MB, so
#    the upper half is unused — deliberately, since raising it would fork the
#    layout per hardware generation (V8 bench boards may carry 8 MB parts).
#    Also note IDF does NOT re-apply defaults to an existing sdkconfig: an
#    old build dir keeps building 8 MB and logs "Detected size(16384k) larger
#    than the size in the binary image header(8192k)".  Delete the stale
#    sdkconfig (the OC keeps one per build dir, #822) to pick this up.
